tests/Mock/ExtendedFetchTransactionSuccess.txt

HTTP/1.1 200 OK
Date: Mon, 17 Apr 2017 21:43:33 GMT
Server: Apache
Set-Cookie: JSESSIONID=1234567890ABCDEF1234567890ABCDEF; Path=/services/; Secure; HttpOnly
Transfer-Encoding: chunked
Content-Type: application/xml
Vary: Accept-Encoding
Strict-Transport-Security: max-age=31536000 ; includeSubDomains

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<order xmlns="http://ws.plimus.com">
  <order-id>1234567</order-id>
  <ordering-shopper>
    <shopper-id>[CUSTOMER_REFERENCE]</shopper-id>
  </ordering-shopper>
  <cart>
    <charged-currency>USD</charged-currency>
    <cart-item>
      <sku>
        <sku-id>[PLAN_REFERENCE]</sku-id>
        <sku-name>Product Name</sku-name>
      </sku>
      <quantity>1</quantity>
      <sku-parameter>
        <param-name>[CUSTOM_1_NAME]</param-name>
        <param-value>[CUSTOM_1_VALUE]</param-value>
      </sku-parameter>
      <sku-parameter>
        <param-name>[CUSTOM_2_NAME]</param-name>
        <param-value>[CUSTOM_2_VALUE]</param-value>
      </sku-parameter>
      <url>https://sandbox.bluesnap.com:443/services/2/subscriptions/[SUBSCRIPTION_REFERENCE]</url>
      <item-sub-total>123.12</item-sub-total>
    </cart-item>
    <tax>[TAX]</tax>
    <tax-rate>0</tax-rate>
    <total-cart-cost>123.12</total-cart-cost>
  </cart>
  <post-sale-info>
    <invoices>
      <invoice>
        <invoice-id>[TRANSACTION_REFERENCE]</invoice-id>
        <url>https://sandbox.bluesnap.com/jsp/show_invoice.jsp?ref=1234567890ABCDEF1234567890ABCDEF</url>
        <financial-transactions>
          <financial-transaction>
            <status>[STATUS]</status>
            <date-due>17-Apr-17</date-due>
            <date-created>[DATE_CREATED]</date-created>
            <amount>[AMOUNT]</amount>
            <currency>[CURRENCY]</currency>
            <soft-descriptor>BLS&#x2a;Merchant Name</soft-descriptor>
            <payment-method>Credit Card</payment-method>
            <target-balance>PLIMUS_ACCOUNT</target-balance>
            <credit-card>
              <card-last-four-digits>[CARD_LAST_FOUR]</card-last-four-digits>
              <card-type>[CARD_BRAND]</card-type>
              <card-sub-type>CREDIT</card-sub-type>
              <expiration-month>[EXPIRY_MONTH]</expiration-month>
              <expiration-year>[EXPIRY_YEAR]</expiration-year>
            </credit-card>
            <paypal-transaction-data/>
            <invoice-contact-info>
              <first-name>[FIRST_NAME]</first-name>
              <last-name>[LAST_NAME]</last-name>
              <email>[EMAIL]</email>
              <state>[STATE]</state>
              <country>[COUNTRY]</country>
              <zip>[POSTCODE]</zip>
            </invoice-contact-info>
            <skus>
              <sku>
                <sku-id>[PLAN_REFERENCE]</sku-id>
              </sku>
            </skus>
          </financial-transaction>
        </financial-transactions>
      </invoice>
    </invoices>
  </post-sale-info>
  <fulfillment>
    <license-keys/>
  </fulfillment>
</order>
